---
type: SharedParameterElement
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# SharedParameterElement

`Autodesk.Revit.DB.SharedParameterElement` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2016 | `public static SharedParameterElement Create ( Document document , ExternalDefinition sharedParameterDefinition )` |
| Method | Lookup | 2016 | `public static SharedParameterElement Lookup ( Document document , Guid guidValue )` |
| Method | ShouldHideWhenNoValue | 2016 | `public bool ShouldHideWhenNoValue ()` |
| Property | GuidValue | 2016 | `public Guid GuidValue { get ; }` |
| Property | Parameter | — | `` |